In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### カラム名のみ抽出したデータフレームを作成し、カレントディレクトリに.xlsxファイルを出力する

In [3]:
def save_col_name_df(df, name):
    '''
    関数の内容
     ・データフレームのカラム名のみ抽出したデータフレームを作成し、.xlsxファイルで出力する関数

    Input
     ・df：データフレーム
     ・name：「○○のカラム名一覧」の○○部分に加えたい文字列
    
     Return
      ・データフレーム先頭から5行、カラム名のみ抽出したデータフレームを.xlsxファイルで出力

    関数使用方法
     ・save_col_name_df(master_df, 'マスタデータ')
     
    '''
    
    df_col_list = df.columns.tolist()
    
    col_df = pd.DataFrame({
        name + 'のカラム一覧':df_col_list
    })
    
    
    return col_df.head(), col_df.to_excel(name + 'のカラム一覧.xlsx', index=False)

In [4]:
save_col_name_df(df, 'titanic')

(  titanicのカラム一覧
 0      survived
 1        pclass
 2           sex
 3           age
 4         sibsp, None)